/* automatically generated by rust-bindgen 0.72.1 */

pub const __BITS_PER_LONG: u32 = 64;
pub const __BITS_PER_LONG_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const UBLK_CMD_GET_QUEUE_AFFINITY: u32 = 1;
pub const UBLK_CMD_GET_DEV_INFO: u32 = 2;
pub const UBLK_CMD_ADD_DEV: u32 = 4;
pub const UBLK_CMD_DEL_DEV: u32 = 5;
pub const UBLK_CMD_START_DEV: u32 = 6;
pub const UBLK_CMD_STOP_DEV: u32 = 7;
pub const UBLK_CMD_SET_PARAMS: u32 = 8;
pub const UBLK_CMD_GET_PARAMS: u32 = 9;
pub const UBLK_CMD_START_USER_RECOVERY: u32 = 16;
pub const UBLK_CMD_END_USER_RECOVERY: u32 = 17;
pub const UBLK_CMD_GET_DEV_INFO2: u32 = 18;
pub const UBLK_FEATURES_LEN: u32 = 8;
pub const UBLK_IO_FETCH_REQ: u32 = 32;
pub const UBLK_IO_COMMIT_AND_FETCH_REQ: u32 = 33;
pub const UBLK_IO_NEED_GET_DATA: u32 = 34;
pub const UBLK_IO_RES_OK: u32 = 0;
pub const UBLK_IO_RES_NEED_GET_DATA: u32 = 1;
pub const UBLKSRV_CMD_BUF_OFFSET: u32 = 0;
pub const UBLKSRV_IO_BUF_OFFSET: u32 = 2147483648;
pub const UBLK_MAX_QUEUE_DEPTH: u32 = 4096;
pub const UBLK_IO_BUF_OFF: u32 = 0;
pub const UBLK_IO_BUF_BITS: u32 = 25;
pub const UBLK_IO_BUF_BITS_MASK: u32 = 33554431;
pub const UBLK_TAG_OFF: u32 = 25;
pub const UBLK_TAG_BITS: u32 = 16;
pub const UBLK_TAG_BITS_MASK: u32 = 65535;
pub const UBLK_QID_OFF: u32 = 41;
pub const UBLK_QID_BITS: u32 = 12;
pub const UBLK_QID_BITS_MASK: u32 = 4095;
pub const UBLK_MAX_NR_QUEUES: u32 = 4096;
pub const UBLKSRV_IO_BUF_TOTAL_BITS: u32 = 53;
pub const UBLKSRV_IO_BUF_TOTAL_SIZE: u64 = 9007199254740992;
pub const UBLK_F_SUPPORT_ZERO_COPY: u32 = 1;
pub const UBLK_F_URING_CMD_COMP_IN_TASK: u32 = 2;
pub const UBLK_F_NEED_GET_DATA: u32 = 4;
pub const UBLK_F_USER_RECOVERY: u32 = 8;
pub const UBLK_F_USER_RECOVERY_REISSUE: u32 = 16;
pub const UBLK_F_UNPRIVILEGED_DEV: u32 = 32;
pub const UBLK_F_CMD_IOCTL_ENCODE: u32 = 64;
pub const UBLK_F_USER_COPY: u32 = 128;
pub const UBLK_F_ZONED: u32 = 256;
pub const UBLK_F_USER_RECOVERY_FAIL_IO: u32 = 512;
pub const UBLK_F_UPDATE_SIZE: u32 = 1024;
pub const UBLK_F_AUTO_BUF_REG: u32 = 2048;
pub const UBLK_F_QUIESCE: u32 = 4096;
pub const UBLK_F_PER_IO_DAEMON: u32 = 8192;
pub const UBLK_S_DEV_DEAD: u32 = 0;
pub const UBLK_S_DEV_LIVE: u32 = 1;
pub const UBLK_S_DEV_QUIESCED: u32 = 2;
pub const UBLK_S_DEV_FAIL_IO: u32 = 3;
pub const UBLK_IO_OP_READ: u32 = 0;
pub const UBLK_IO_OP_WRITE: u32 = 1;
pub const UBLK_IO_OP_FLUSH: u32 = 2;
pub const UBLK_IO_OP_DISCARD: u32 = 3;
pub const UBLK_IO_OP_WRITE_SAME: u32 = 4;
pub const UBLK_IO_OP_WRITE_ZEROES: u32 = 5;
pub const UBLK_IO_OP_ZONE_OPEN: u32 = 10;
pub const UBLK_IO_OP_ZONE_CLOSE: u32 = 11;
pub const UBLK_IO_OP_ZONE_FINISH: u32 = 12;
pub const UBLK_IO_OP_ZONE_APPEND: u32 = 13;
pub const UBLK_IO_OP_ZONE_RESET_ALL: u32 = 14;
pub const UBLK_IO_OP_ZONE_RESET: u32 = 15;
pub const UBLK_IO_OP_REPORT_ZONES: u32 = 18;
pub const UBLK_IO_F_FAILFAST_DEV: u32 = 256;
pub const UBLK_IO_F_FAILFAST_TRANSPORT: u32 = 512;
pub const UBLK_IO_F_FAILFAST_DRIVER: u32 = 1024;
pub const UBLK_IO_F_META: u32 = 2048;
pub const UBLK_IO_F_FUA: u32 = 8192;
pub const UBLK_IO_F_NOUNMAP: u32 = 32768;
pub const UBLK_IO_F_SWAP: u32 = 65536;
pub const UBLK_IO_F_NEED_REG_BUF: u32 = 131072;
pub const UBLK_AUTO_BUF_REG_FALLBACK: u32 = 1;
pub const UBLK_AUTO_BUF_REG_F_MASK: u32 = 1;
pub const UBLK_ATTR_READ_ONLY: u32 = 1;
pub const UBLK_ATTR_ROTATIONAL: u32 = 2;
pub const UBLK_ATTR_VOLATILE_CACHE: u32 = 4;
pub const UBLK_ATTR_FUA: u32 = 8;
pub const UBLK_MIN_SEGMENT_SIZE: u32 = 4096;
pub const UBLK_PARAM_TYPE_BASIC: u32 = 1;
pub const UBLK_PARAM_TYPE_DISCARD: u32 = 2;
pub const UBLK_PARAM_TYPE_DEVT: u32 = 4;
pub const UBLK_PARAM_TYPE_ZONED: u32 = 8;
pub const UBLK_PARAM_TYPE_DMA_ALIGN: u32 = 16;
pub const UBLK_PARAM_TYPE_SEGMENT: u32 = 32;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"]
        [::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"]
        [::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int),
>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"]
        [::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"]
        [::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublksrv_ctrl_cmd {
    pub dev_id: __u32,
    pub queue_id: __u16,
    pub len: __u16,
    pub addr: __u64,
    pub data: [__u64; 1usize],
    pub dev_path_len: __u16,
    pub pad: __u16,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublksrv_ctrl_cmd"]
        [::std::mem::size_of::<ublksrv_ctrl_cmd>() - 32usize];
    ["Alignment of ublksrv_ctrl_cmd"]
        [::std::mem::align_of::<ublksrv_ctrl_cmd>() - 8usize];
    ["Offset of field: ublksrv_ctrl_cmd::dev_id"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, dev_id) - 0usize];
    ["Offset of field: ublksrv_ctrl_cmd::queue_id"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, queue_id) - 4usize];
    ["Offset of field: ublksrv_ctrl_cmd::len"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, len) - 6usize];
    ["Offset of field: ublksrv_ctrl_cmd::addr"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, addr) - 8usize];
    ["Offset of field: ublksrv_ctrl_cmd::data"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, data) - 16usize];
    ["Offset of field: ublksrv_ctrl_cmd::dev_path_len"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, dev_path_len) - 24usize];
    ["Offset of field: ublksrv_ctrl_cmd::pad"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, pad) - 26usize];
    ["Offset of field: ublksrv_ctrl_cmd::reserved"]
        [::std::mem::offset_of!(ublksrv_ctrl_cmd, reserved) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublksrv_ctrl_dev_info {
    pub nr_hw_queues: __u16,
    pub queue_depth: __u16,
    pub state: __u16,
    pub pad0: __u16,
    pub max_io_buf_bytes: __u32,
    pub dev_id: __u32,
    pub ublksrv_pid: __s32,
    pub pad1: __u32,
    pub flags: __u64,
    pub ublksrv_flags: __u64,
    pub owner_uid: __u32,
    pub owner_gid: __u32,
    pub reserved1: __u64,
    pub reserved2: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublksrv_ctrl_dev_info"]
        [::std::mem::size_of::<ublksrv_ctrl_dev_info>() - 64usize];
    ["Alignment of ublksrv_ctrl_dev_info"]
        [::std::mem::align_of::<ublksrv_ctrl_dev_info>() - 8usize];
    ["Offset of field: ublksrv_ctrl_dev_info::nr_hw_queues"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        nr_hw_queues
    ) - 0usize];
    ["Offset of field: ublksrv_ctrl_dev_info::queue_depth"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        queue_depth
    ) - 2usize];
    ["Offset of field: ublksrv_ctrl_dev_info::state"]
        [::std::mem::offset_of!(ublksrv_ctrl_dev_info, state) - 4usize];
    ["Offset of field: ublksrv_ctrl_dev_info::pad0"]
        [::std::mem::offset_of!(ublksrv_ctrl_dev_info, pad0) - 6usize];
    ["Offset of field: ublksrv_ctrl_dev_info::max_io_buf_bytes"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        max_io_buf_bytes
    )
        - 8usize];
    ["Offset of field: ublksrv_ctrl_dev_info::dev_id"]
        [::std::mem::offset_of!(ublksrv_ctrl_dev_info, dev_id) - 12usize];
    ["Offset of field: ublksrv_ctrl_dev_info::ublksrv_pid"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        ublksrv_pid
    ) - 16usize];
    ["Offset of field: ublksrv_ctrl_dev_info::pad1"]
        [::std::mem::offset_of!(ublksrv_ctrl_dev_info, pad1) - 20usize];
    ["Offset of field: ublksrv_ctrl_dev_info::flags"]
        [::std::mem::offset_of!(ublksrv_ctrl_dev_info, flags) - 24usize];
    ["Offset of field: ublksrv_ctrl_dev_info::ublksrv_flags"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        ublksrv_flags
    ) - 32usize];
    ["Offset of field: ublksrv_ctrl_dev_info::owner_uid"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        owner_uid
    ) - 40usize];
    ["Offset of field: ublksrv_ctrl_dev_info::owner_gid"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        owner_gid
    ) - 44usize];
    ["Offset of field: ublksrv_ctrl_dev_info::reserved1"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        reserved1
    ) - 48usize];
    ["Offset of field: ublksrv_ctrl_dev_info::reserved2"][::std::mem::offset_of!(
        ublksrv_ctrl_dev_info,
        reserved2
    ) - 56usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ublksrv_io_desc {
    pub op_flags: __u32,
    pub __bindgen_anon_1: ublksrv_io_desc__bindgen_ty_1,
    pub start_sector: __u64,
    pub addr: __u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ublksrv_io_desc__bindgen_ty_1 {
    pub nr_sectors: __u32,
    pub nr_zones: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublksrv_io_desc__bindgen_ty_1"]
        [::std::mem::size_of::<ublksrv_io_desc__bindgen_ty_1>() - 4usize];
    ["Alignment of ublksrv_io_desc__bindgen_ty_1"]
        [::std::mem::align_of::<ublksrv_io_desc__bindgen_ty_1>() - 4usize];
    ["Offset of field: ublksrv_io_desc__bindgen_ty_1::nr_sectors"][::std::mem::offset_of!(
        ublksrv_io_desc__bindgen_ty_1,
        nr_sectors
    )
        - 0usize];
    ["Offset of field: ublksrv_io_desc__bindgen_ty_1::nr_zones"][::std::mem::offset_of!(
        ublksrv_io_desc__bindgen_ty_1,
        nr_zones
    )
        - 0usize];
};
impl Default for ublksrv_io_desc__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublksrv_io_desc"]
        [::std::mem::size_of::<ublksrv_io_desc>() - 24usize];
    ["Alignment of ublksrv_io_desc"]
        [::std::mem::align_of::<ublksrv_io_desc>() - 8usize];
    ["Offset of field: ublksrv_io_desc::op_flags"]
        [::std::mem::offset_of!(ublksrv_io_desc, op_flags) - 0usize];
    ["Offset of field: ublksrv_io_desc::start_sector"]
        [::std::mem::offset_of!(ublksrv_io_desc, start_sector) - 8usize];
    ["Offset of field: ublksrv_io_desc::addr"]
        [::std::mem::offset_of!(ublksrv_io_desc, addr) - 16usize];
};
impl Default for ublksrv_io_desc {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_auto_buf_reg {
    pub index: __u16,
    pub flags: __u8,
    pub reserved0: __u8,
    pub reserved1: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_auto_buf_reg"]
        [::std::mem::size_of::<ublk_auto_buf_reg>() - 8usize];
    ["Alignment of ublk_auto_buf_reg"]
        [::std::mem::align_of::<ublk_auto_buf_reg>() - 4usize];
    ["Offset of field: ublk_auto_buf_reg::index"]
        [::std::mem::offset_of!(ublk_auto_buf_reg, index) - 0usize];
    ["Offset of field: ublk_auto_buf_reg::flags"]
        [::std::mem::offset_of!(ublk_auto_buf_reg, flags) - 2usize];
    ["Offset of field: ublk_auto_buf_reg::reserved0"]
        [::std::mem::offset_of!(ublk_auto_buf_reg, reserved0) - 3usize];
    ["Offset of field: ublk_auto_buf_reg::reserved1"]
        [::std::mem::offset_of!(ublk_auto_buf_reg, reserved1) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ublksrv_io_cmd {
    pub q_id: __u16,
    pub tag: __u16,
    pub result: __s32,
    pub __bindgen_anon_1: ublksrv_io_cmd__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ublksrv_io_cmd__bindgen_ty_1 {
    pub addr: __u64,
    pub zone_append_lba: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublksrv_io_cmd__bindgen_ty_1"]
        [::std::mem::size_of::<ublksrv_io_cmd__bindgen_ty_1>() - 8usize];
    ["Alignment of ublksrv_io_cmd__bindgen_ty_1"]
        [::std::mem::align_of::<ublksrv_io_cmd__bindgen_ty_1>() - 8usize];
    ["Offset of field: ublksrv_io_cmd__bindgen_ty_1::addr"][::std::mem::offset_of!(
        ublksrv_io_cmd__bindgen_ty_1,
        addr
    ) - 0usize];
    ["Offset of field: ublksrv_io_cmd__bindgen_ty_1::zone_append_lba"][::std::mem::offset_of!(
        ublksrv_io_cmd__bindgen_ty_1,
        zone_append_lba
    )
        - 0usize];
};
impl Default for ublksrv_io_cmd__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublksrv_io_cmd"]
        [::std::mem::size_of::<ublksrv_io_cmd>() - 16usize];
    ["Alignment of ublksrv_io_cmd"]
        [::std::mem::align_of::<ublksrv_io_cmd>() - 8usize];
    ["Offset of field: ublksrv_io_cmd::q_id"]
        [::std::mem::offset_of!(ublksrv_io_cmd, q_id) - 0usize];
    ["Offset of field: ublksrv_io_cmd::tag"]
        [::std::mem::offset_of!(ublksrv_io_cmd, tag) - 2usize];
    ["Offset of field: ublksrv_io_cmd::result"]
        [::std::mem::offset_of!(ublksrv_io_cmd, result) - 4usize];
};
impl Default for ublksrv_io_cmd {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_param_basic {
    pub attrs: __u32,
    pub logical_bs_shift: __u8,
    pub physical_bs_shift: __u8,
    pub io_opt_shift: __u8,
    pub io_min_shift: __u8,
    pub max_sectors: __u32,
    pub chunk_sectors: __u32,
    pub dev_sectors: __u64,
    pub virt_boundary_mask: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_param_basic"]
        [::std::mem::size_of::<ublk_param_basic>() - 32usize];
    ["Alignment of ublk_param_basic"]
        [::std::mem::align_of::<ublk_param_basic>() - 8usize];
    ["Offset of field: ublk_param_basic::attrs"]
        [::std::mem::offset_of!(ublk_param_basic, attrs) - 0usize];
    ["Offset of field: ublk_param_basic::logical_bs_shift"][::std::mem::offset_of!(
        ublk_param_basic,
        logical_bs_shift
    ) - 4usize];
    ["Offset of field: ublk_param_basic::physical_bs_shift"][::std::mem::offset_of!(
        ublk_param_basic,
        physical_bs_shift
    ) - 5usize];
    ["Offset of field: ublk_param_basic::io_opt_shift"]
        [::std::mem::offset_of!(ublk_param_basic, io_opt_shift) - 6usize];
    ["Offset of field: ublk_param_basic::io_min_shift"]
        [::std::mem::offset_of!(ublk_param_basic, io_min_shift) - 7usize];
    ["Offset of field: ublk_param_basic::max_sectors"]
        [::std::mem::offset_of!(ublk_param_basic, max_sectors) - 8usize];
    ["Offset of field: ublk_param_basic::chunk_sectors"][::std::mem::offset_of!(
        ublk_param_basic,
        chunk_sectors
    ) - 12usize];
    ["Offset of field: ublk_param_basic::dev_sectors"]
        [::std::mem::offset_of!(ublk_param_basic, dev_sectors) - 16usize];
    ["Offset of field: ublk_param_basic::virt_boundary_mask"][::std::mem::offset_of!(
        ublk_param_basic,
        virt_boundary_mask
    ) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_param_discard {
    pub discard_alignment: __u32,
    pub discard_granularity: __u32,
    pub max_discard_sectors: __u32,
    pub max_write_zeroes_sectors: __u32,
    pub max_discard_segments: __u16,
    pub reserved0: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_param_discard"]
        [::std::mem::size_of::<ublk_param_discard>() - 20usize];
    ["Alignment of ublk_param_discard"]
        [::std::mem::align_of::<ublk_param_discard>() - 4usize];
    ["Offset of field: ublk_param_discard::discard_alignment"][::std::mem::offset_of!(
        ublk_param_discard,
        discard_alignment
    ) - 0usize];
    ["Offset of field: ublk_param_discard::discard_granularity"][::std::mem::offset_of!(
        ublk_param_discard,
        discard_granularity
    )
        - 4usize];
    ["Offset of field: ublk_param_discard::max_discard_sectors"][::std::mem::offset_of!(
        ublk_param_discard,
        max_discard_sectors
    )
        - 8usize];
    ["Offset of field: ublk_param_discard::max_write_zeroes_sectors"][::std::mem::offset_of!(
        ublk_param_discard,
        max_write_zeroes_sectors
    )
        - 12usize];
    ["Offset of field: ublk_param_discard::max_discard_segments"][::std::mem::offset_of!(
        ublk_param_discard,
        max_discard_segments
    )
        - 16usize];
    ["Offset of field: ublk_param_discard::reserved0"]
        [::std::mem::offset_of!(ublk_param_discard, reserved0) - 18usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_param_devt {
    pub char_major: __u32,
    pub char_minor: __u32,
    pub disk_major: __u32,
    pub disk_minor: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_param_devt"]
        [::std::mem::size_of::<ublk_param_devt>() - 16usize];
    ["Alignment of ublk_param_devt"]
        [::std::mem::align_of::<ublk_param_devt>() - 4usize];
    ["Offset of field: ublk_param_devt::char_major"]
        [::std::mem::offset_of!(ublk_param_devt, char_major) - 0usize];
    ["Offset of field: ublk_param_devt::char_minor"]
        [::std::mem::offset_of!(ublk_param_devt, char_minor) - 4usize];
    ["Offset of field: ublk_param_devt::disk_major"]
        [::std::mem::offset_of!(ublk_param_devt, disk_major) - 8usize];
    ["Offset of field: ublk_param_devt::disk_minor"]
        [::std::mem::offset_of!(ublk_param_devt, disk_minor) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_param_zoned {
    pub max_open_zones: __u32,
    pub max_active_zones: __u32,
    pub max_zone_append_sectors: __u32,
    pub reserved: __u32,
    pub reserved2: __u64,
    pub reserved3: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_param_zoned"]
        [::std::mem::size_of::<ublk_param_zoned>() - 32usize];
    ["Alignment of ublk_param_zoned"]
        [::std::mem::align_of::<ublk_param_zoned>() - 8usize];
    ["Offset of field: ublk_param_zoned::max_open_zones"][::std::mem::offset_of!(
        ublk_param_zoned,
        max_open_zones
    ) - 0usize];
    ["Offset of field: ublk_param_zoned::max_active_zones"][::std::mem::offset_of!(
        ublk_param_zoned,
        max_active_zones
    ) - 4usize];
    ["Offset of field: ublk_param_zoned::max_zone_append_sectors"][::std::mem::offset_of!(
        ublk_param_zoned,
        max_zone_append_sectors
    )
        - 8usize];
    ["Offset of field: ublk_param_zoned::reserved"]
        [::std::mem::offset_of!(ublk_param_zoned, reserved) - 12usize];
    ["Offset of field: ublk_param_zoned::reserved2"]
        [::std::mem::offset_of!(ublk_param_zoned, reserved2) - 16usize];
    ["Offset of field: ublk_param_zoned::reserved3"]
        [::std::mem::offset_of!(ublk_param_zoned, reserved3) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_param_dma_align {
    pub alignment: __u32,
    pub pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_param_dma_align"]
        [::std::mem::size_of::<ublk_param_dma_align>() - 8usize];
    ["Alignment of ublk_param_dma_align"]
        [::std::mem::align_of::<ublk_param_dma_align>() - 4usize];
    ["Offset of field: ublk_param_dma_align::alignment"]
        [::std::mem::offset_of!(ublk_param_dma_align, alignment) - 0usize];
    ["Offset of field: ublk_param_dma_align::pad"]
        [::std::mem::offset_of!(ublk_param_dma_align, pad) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_param_segment {
    pub seg_boundary_mask: __u64,
    pub max_segment_size: __u32,
    pub max_segments: __u16,
    pub pad: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_param_segment"]
        [::std::mem::size_of::<ublk_param_segment>() - 16usize];
    ["Alignment of ublk_param_segment"]
        [::std::mem::align_of::<ublk_param_segment>() - 8usize];
    ["Offset of field: ublk_param_segment::seg_boundary_mask"][::std::mem::offset_of!(
        ublk_param_segment,
        seg_boundary_mask
    ) - 0usize];
    ["Offset of field: ublk_param_segment::max_segment_size"][::std::mem::offset_of!(
        ublk_param_segment,
        max_segment_size
    ) - 8usize];
    ["Offset of field: ublk_param_segment::max_segments"][::std::mem::offset_of!(
        ublk_param_segment,
        max_segments
    ) - 12usize];
    ["Offset of field: ublk_param_segment::pad"]
        [::std::mem::offset_of!(ublk_param_segment, pad) - 14usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ublk_params {
    pub len: __u32,
    pub types: __u32,
    pub basic: ublk_param_basic,
    pub discard: ublk_param_discard,
    pub devt: ublk_param_devt,
    pub zoned: ublk_param_zoned,
    pub dma: ublk_param_dma_align,
    pub seg: ublk_param_segment,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ublk_params"]
        [::std::mem::size_of::<ublk_params>() - 136usize];
    ["Alignment of ublk_params"]
        [::std::mem::align_of::<ublk_params>() - 8usize];
    ["Offset of field: ublk_params::len"]
        [::std::mem::offset_of!(ublk_params, len) - 0usize];
    ["Offset of field: ublk_params::types"]
        [::std::mem::offset_of!(ublk_params, types) - 4usize];
    ["Offset of field: ublk_params::basic"]
        [::std::mem::offset_of!(ublk_params, basic) - 8usize];
    ["Offset of field: ublk_params::discard"]
        [::std::mem::offset_of!(ublk_params, discard) - 40usize];
    ["Offset of field: ublk_params::devt"]
        [::std::mem::offset_of!(ublk_params, devt) - 60usize];
    ["Offset of field: ublk_params::zoned"]
        [::std::mem::offset_of!(ublk_params, zoned) - 80usize];
    ["Offset of field: ublk_params::dma"]
        [::std::mem::offset_of!(ublk_params, dma) - 112usize];
    ["Offset of field: ublk_params::seg"]
        [::std::mem::offset_of!(ublk_params, seg) - 120usize];
};
